from constants import *

# Здесь должен быть реализован класс cloud со своим методом draw
# И процедура при вызове которой:
# в массиве clouds создается новый объект (со случайной координатой и формой) типа cloud,
# удаляет ненужные облака из списка clouds и отрисовывает все на экране.


def clouds_run(win, clouds, clouds_img):
    """Процедура, при вызове которой отрисовываются
    Аргументы:
    win - окно отрисовки
    clouds - массив в котором содержатся объекты типа cloud, активные в данный момент
    clouds_img - возможные формы облаков из которых каждый раз надо выбирать случайную"""
    pass